Repository: wp-plugins/10bit-paybuttons-pelecard
Catalog: languages/10bit-paybuttons-pelecard-*.po
Languages: he_il

source: pelecard Pay Buttons
he_il: כפתורי תשלום פלאכארד

source: Settings saved.
he_il: שמרתי את ההגדרות.

source: 10Bit pelecard PayButtons Settings
he_il: כפתורי תשלום פלאכארד

source: Terminal Number
he_il: מספר מסוף סליקה

source: Username
he_il: שם משתמש

source: Password
he_il: סיסמה

source: Maximum Payments
he_il: מספר תשלמים מקסימלי

source: Currency
he_il: מטבע

source: ILS
he_il: ש"ח

source: USD
he_il: דולר

source: Success ( thank you ) page URL
he_il: כתובת הצלחה ( דף תודה )

source: Error page URL
he_il: כתובת כשלון

source: Path to custom logo
he_il: קישור ללוגו

source: Path to small custom logo
he_il: קישור ללוגו קטן

source: Hide PCI DSS logo
he_il: הסתר את הלוגו של PCI DSS

source: Hide Pelecard logo
he_il: הסתר את לוגו פלאכארד

source: Path To custom Style sheet(CSS)
he_il: כתובת כשלון

source: must be a secured URL ( HTTPS )
he_il: חייב להיות מכתובת מאובטחת (HTTPS )

source: Background color
he_il: צבע רקע

source: Use hexadecimal color without the #
he_il: ערך הקסדצימלי ללא #

source: Save Changes
he_il: שמור שינויים

source: Usage :
he_il: שימוש

source: Add the following short code inside a post or a page :
he_il: הוסיפו את השורטקוד הבא לדף או לעמוד באתר

source: value : The amount to pay
he_il: value : הסכום לתשלום

source: item_name : the name of the sold item
he_il: item_name : שם המוצר למכירה

source: button_class : CSS class for styling
he_il: button_class : קלאס CSS לעיצוב

source: button_text : Text to show on the button
he_il: button_text : הטקסט שיופיע על הכפתור
